{
    "name": "Sean Swanson",
    "title": "Front-End Web Developer",
    "contact": {
        "address": "Seattle, WA 98133",
        "email": "seancswan@gmail.com",
        "website": "seancswanson.com",
        "phone": "+1 (425) 458-8778"
    },
    "summary": "A passionate and skilled front-end developer with experience building with technologies such as HTML, CSS w/ SCSS, JavaScript w/ TypeScript, Angular, CMS, 3rd Party APIs. Strong problem-solving abilities and a proven ability to work effectively in an agile team environment. A lifelong learner with a proven ability to teach and lead others. My diverse range of interests allow me to tackle most challenges in the software development life cycle, from design to DevOps, with a well-rounded and empathetic perspective.",
    "professionalExperience": [
        {
            "company": "DREAMBOX LEARNING",
            "location": "Bellevue, WA",
            "showLogo": true,
            "positions": [
                {
                    "title": "Website/Digital Marketing Manager",
                    "startDate": "Feb 2023",
                    "endDate": "Present",
                    "responsibilities": [
                        "Collaborated with stakeholders across the org to create and distribute content, improving brand visibility and customer engagement",
                        "Successfully managed and lead wide range of projects including the sunsetting of two major product websites.",
                        "Designed and implemented landing pages optimized for conversions, utilizing UI/UX best practices and SEO guidelines",
                        "Leveraged tools such as SEMRush, Google Analytics, and Google Tag Manager to analyze website traffic, improve SEO efforts, and optimize user journey.",
                        "Developed features and bug fixes as part of an Agile team, using technologies such as Next.js, React, TypeScript, HTML, and CSS",
                        "Managed relationships with external vendors, such as SEO agencies and development teams, to optimize website performance and maintain a strong digital presence",
                        "Wrote and maintained documentation to ensure code quality and stability, while managing and reviewing pull requests for production deployments",
                        "Implemented cookie consent management to ensure website compliance with data protection regulations",
                        "Utilized various DevOps practices, including monitoring website health through dashboards to triage issues and identify root causes",
                        "Collaborated with cross-functional team members to deliver successful projects on time and within scope"
                    ]
                },
                {
                    "title": "Software Development Engineer – Front-End",
                    "startDate": "May 2021",
                    "endDate": "Feb 2023",
                    "responsibilities": [
                        "Internally promoted to Engineering from Client Support",
                        "Contributed code on the Math Insights Dashboard, developing reports, data visualizations, and classroom management tools for educators",
                        "Utilized technologies such as Angular, JavaScript w/ TypeScript, SCSS, and Storybook",
                        "Refactored the client application build process to improve compilation time from ~100 seconds to <5 seconds shortening the feedback loop for developers to see their code changes live",
                        "Participated in a cross-functional, self-organizing Scrum team that used test-driven development and a CI/CD pipeline to deliver value quickly and reduce risks",
                        "Supported the development process from test planning to deployment and monitoring using tools such as Amazon Web Services S3, New Relic, Nomad, Drone, Kibana, Docker, Postman, Jira, and Jenkins",
                        "As a certified Scrum Master, successfully supported a team of 8 developers as both a technical contributor and agile coach, ensuring that our project was delivered efficiently and effectively."
                    ]
                },
                {
                    "title": "Client Support Specialist",
                    "startDate": "May 2019",
                    "endDate": "May 2021",
                    "responsibilities": [
                        "Collaborated with engineering, client experience, and marketing departments to deliver customized client solutions",
                        "Utilized JavaScript to develop internal scripts, including UI improvements and DOM manipulation for internal tools",
                        "Led technical training sessions, including troubleshooting and case operations",
                        "Created and implemented a method for efficiently processing client data and establishing best practices for documenting related casework, resulting in a significant increase in productivity (~33% faster completion of case reporting)",
                        "Provided specialized technical expertise to assist in the rapid implementation and onboarding of DreamBox Learning in schools nationwide",
                        "Offered specialized technical knowledge in collaboration with other internal teams to quickly implement and onboard DreamBox Learning in schools across the country."
                    ]
                }
            ]
        },
        {
            "company": "TRADITIONS OF THE ANCESTORS",
            "location": "Seattle, WA",
            "title": "Junior Web Developer",
            "startDate": "April 2018",
            "endDate": "May 2019",
            "showLogo": true,
            "responsibilities": [
                "Collaborated on a team of ~20 to build a platform for exploring and connecting with the world's cultures",
                "Contributed to the implementation of a data visualization, work on the user-facing and site admin UI, and event tracking with Google Analytics",
                "Used technologies such as JavaScript, Node.js, Express.js, jQuery, Underscore, MySQL, and Google Analytics"
            ]
        },
        {
            "company": "IAN GILMAN",
            "location": "Seattle, WA",
            "title": "Apprentice Web Developer",
            "startDate": "March 2018",
            "endDate": "May 2019",
            "showLogo": true,
            "responsibilities": [
                "Collaborated with senior web engineers and clients (e.g. Schema Design Agency) to bring projects from conception to deployment",
                "Engaged in pair programming, with a focus on front-end frameworks and languages as well as some exposure to back-end development",
                "Utilized a wide range of technologies including JavaScript, ES6, React.js, Node.js, Express.js, Three.js, Pixi.js, Hammer.js, WebGL, Aframe.js, WebVR, Lodash, Underscore, templating, WordPress, HTML, and CSS",
                "Leveraged various telecom, version control, and project management tools including Git, SVN, GitHub, BitBucket, Asana, Jira, and Slack to efficiently deliver high-quality software solutions"
            ]
        }
    ],
    "education": [
        {
            "institution": "GENERAL ASSEMBLY",
            "location": "Seattle, WA",
            "degree": "Web Development Immersive Graduate",
            "startDate": "2018",
            "endDate": "2019"
        },
        {
            "institution": "UNIVERSITY OF WASHINGTON",
            "location": "Seattle, WA",
            "degree": "Bachelor of Arts in Philosophy",
            "startDate": "2014",
            "endDate": "2015"
        }
    ],
    "certifications": [
        "Certified Scrum Master (2021)",
        "Certified SAFe Scrum Master (2022)"
    ],
    "additionalInformation": {
        "software": {
            "Front-end Development": [
                "HTML",
                "CSS",
                "JavaScript",
                "TypeScript",
                "Angular",
                "React"
            ],
            "CSS Frameworks and Preprocessors": [
                "Tailwind CSS",
                "SCSS",
                "Bootstrap",
                "Materialize CSS"
            ],
            "Web Frameworks": [
                "Astro.js",
                "Next.js"
            ],
            "Design and Prototyping": [
                "Figma",
                "Sketch",
                "Pen and Paper",
                "Excalidraw"
            ],
            "Multimedia Tools": [
                "DaVinci Resolve",
                "Blender 3D",
                "Photoshop"
            ],
            "SEO and Performance Monitoring Tools": [
                "Google Analytics",
                "Google Search Console",
                "Google Tag Manager",
                "SEMrush",
                "Lighthouse",
                "New Relic",
                "Kibana"
            ],
            "Accessibility Tools": [
                "WAVE",
                "axe Accessibility Checker"
            ],
            "Back-end Development": [
                "Node.js",
                "Express.js"
            ],
            "Database Management": [
                "SQL",
                "MySQL",
                "PostgreSQL",
                "MongoDB"
            ],
            "Version Control": [
                "Git",
                "GitHub",
                "Bitbucket"
            ],
            "Deployment, Hosting, and CI/CD": [
                "AWS",
                "Heroku",
                "Vercel",
                "Jenkins",
                "Drone"
            ],
            "Testing Tools": [
                "Jasmine",
                "Selenium"
            ],
            "Content Management Systems": [
                "WordPress",
                "Sanity",
                "Laravel Nova"
            ],
            "Project Management and Collaboration": [
                "Jira",
                "Asana",
                "Trello",
                "Slack",
                "Microsoft Teams"
            ],
            "Cloud Computing Platforms": [
                "Microsoft Azure",
                "Amazon Web Services (AWS)"
            ]
        },
        "awards": [
            "DreamBox Learning Step Up (2019)"
        ]
    }
}